org/2016/04/09/Getting-towards-an-infix-notation-for-hy.org
* Getting towards an infix notation for hy
  :PROPERTIES:
  :categories: hylang
  :date:     2016/04/09 14:54:04
  :updated:  2016/04/09 14:54:04
  :END:

Engineers need infix notation. It's a bold statement I know, but I am an engineer, teach engineers, and write a fair bit of mathematical programs. Your typical engineer is not a programmer, and just wants to write an equation they way we would write it on paper. It is hard to undo 20+ years of education on that point! So, here we consider how to adapt hy to use infix notation.

In a recent [[http://kitchingroup.cheme.cmu.edu/blog/2016/03/31/More-on-Hy-and-why-I-think-it-is-a-big-deal/][post]] [[https://disqus.com/by/disqus_LNqeXKtJMi/][gilch]] suggested using strings with the builtin python eval function. There are some potential downsides to that approach including the overhead of byte-compiling each time it is eval'd,  but the payoff is operator precedence, and doing it like you would do it in Python.

Here is one implementation.

#+BEGIN_SRC hy :tangle infix.hy
(def py-eval (get __builtins__ "eval"))
#+END_SRC

And how to use it.
#+BEGIN_SRC hy
(import [infix [*]])

(print (py-eval "2+3*5"))

(import [numpy :as np])
(print (py-eval "2 * np.exp(np.pi / 2)"))
#+END_SRC

#+RESULTS:
: 17
: 9.62095476193

We can eliminate the need for quotes with the stringify code we previously developed.

#+BEGIN_SRC hy
(import [serialize [*]])
(import [infix [*]])

(print (py-eval (stringify `(2+3*5))))
(print (py-eval (stringify `(2 + 3 * 5))))

(import [numpy :as np])
(print (py-eval (stringify `(2 * np.exp(np.pi / 2)))))
#+END_SRC

#+RESULTS:
: 17
: 17
: 9.62095476193

Let's just take that one more step with a new reader macro so we can avoid the quoting.

#+BEGIN_SRC hy :tangle infix.hy
(defn pymath [code] (py-eval (stringify code)))

(defreader p [code]
 (pymath code))
#+END_SRC

Now we can use it like this. We have to require the infix module to get the reader macro.
#+BEGIN_SRC hy
(import [serialize [*]])
(import [infix [*]])
(require infix)

(print (pymath `(2 + 3)))
(print #p(2 + 3 * 5))
(print #p((2 + 3) * 5))
#+END_SRC

#+RESULTS:
: 5
: 17
: 25

That looks like it works, but this next example doesn't work. It seems to be a namespace issue, where np is not defined when the function is executed or the reader macro is expanded, which occurs in some separate namespace I think. The first example works, but the second and third don't. I don't know if that is fixable. If anyone knows how, drop me a note in the comments!

#+BEGIN_SRC hy
(import [serialize [*]])
(import [infix [*]])
(require infix)

(import [numpy :as np])

(print (py-eval (stringify `(2 * np.exp(np.pi / 2)))))

(try
 (print (pymath `(2 * np.exp(np.pi / 2))))
 (except [e Exception]
   (print "pymath: " e)))

;; this excepts so bad the try doesn't even catch it!
;; (try
;;  (print #p(2 * np.exp(np.pi / 2)))
;;  (except [e2 Exception]
;;    (print "reader macro: " e2)))
#+END_SRC

#+RESULTS:
: 9.62095476193
: pymath:  name 'np' is not defined

This also does not work for a similar namespace issue.
#+BEGIN_SRC hy
(import [serialize [*]])
(import [infix [*]])
(require infix)

(import [numpy :as np])

(setv x 5)
(try
 (print (pymath `(3 * x)))
 (except [e Exception] (print e)))
#+END_SRC

#+RESULTS:
: name 'x' is not defined

Well, no problem, we will try some other approaches.

