_posts/2016-04-09-Getting-towards-an-infix-notation-for-hy.html
---
title: Getting towards an infix notation for hy
date: 2016/04/09 14:54:04
updated: 2016/04/09 14:54:04
categories: hylang
tags: 
---


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Infix to prefix using code manipulation</a></li>
<li><a href="#sec-2">2. The final test</a></li>
</ul>
</div>
</div>

<p>
Engineers need infix notation. It's a bold statement I know, but I am an engineer, teach engineers, and write a fair bit of mathematical programs. Your typical engineer is not a programmer, and just wants to write an equation they way we would write it on paper. It is hard to undo 20+ years of education on that point! So, here we consider how to adapt hy to use infix notation.
</p>

<p>
In a recent <a href="http://kitchingroup.cheme.cmu.edu/blog/2016/03/31/More-on-Hy-and-why-I-think-it-is-a-big-deal/">post</a> <a href="https://disqus.com/by/disqus_LNqeXKtJMi/">gilch</a> suggested using strings with the builtin python eval function. There are some potential downsides to that approach including the overhead of byte-compiling each time it is eval'd,  but the payoff is operator precedence, and doing it like you would do it in Python.
</p>

<p>
Here is one implementation.
</p>

<div class="org-src-container">

<pre class="src src-hy">(<span style="color: #006FE0;">def</span> py-eval (<span style="color: #006FE0;">get</span> __builtins__ <span style="color: #008000;">"eval"</span>))
</pre>
</div>

<p>
And how to use it.
</p>
<div class="org-src-container">

<pre class="src src-hy">(import [infix [*]])

(<span style="color: #006FE0;">print</span> (py-eval <span style="color: #008000;">"2+3*5"</span>))

(import [numpy <span style="color: #D0372D;">:as</span> np])
(<span style="color: #006FE0;">print</span> (py-eval <span style="color: #008000;">"2 * np.exp(np.pi / 2)"</span>))
</pre>
</div>

<pre class="example">
17
9.62095476193
</pre>

<p>
We can eliminate the need for quotes with the stringify code we previously developed.
</p>

<div class="org-src-container">

<pre class="src src-hy">(import [serialize [*]])
(import [infix [*]])

(<span style="color: #006FE0;">print</span> (py-eval (stringify `(2+3*5))))
(<span style="color: #006FE0;">print</span> (py-eval (stringify `(2 + 3 * 5))))

(import [numpy <span style="color: #D0372D;">:as</span> np])
(<span style="color: #006FE0;">print</span> (py-eval (stringify `(2 * np.exp(np.pi / 2)))))
</pre>
</div>

<pre class="example">
17
17
9.62095476193
</pre>

<p>
Let's just take that one more step with a new reader macro so we can avoid the quoting.
</p>

<div class="org-src-container">

<pre class="src src-hy">(<span style="color: #0000FF;">defn</span> <span style="color: #006699;">pymath</span> [code] (py-eval (stringify code)))

(<span style="color: #0000FF;">defreader</span> <span style="color: #006699;">p</span> [code]
 (pymath code))
</pre>
</div>

<p>
Now we can use it like this. We have to require the infix module to get the reader macro.
</p>
<div class="org-src-container">

<pre class="src src-hy">(import [serialize [*]])
(import [infix [*]])
(<span style="color: #0000FF;">require</span> <span style="color: #006699;">infix</span>)

(<span style="color: #006FE0;">print</span> (pymath `(2 + 3)))
(<span style="color: #006FE0;">print</span> #p(2 + 3 * 5))
(<span style="color: #006FE0;">print</span> #p((2 + 3) * 5))
</pre>
</div>

<pre class="example">
5
17
25
</pre>

<p>
That looks like it works, but this next example doesn't work. It seems to be a namespace issue, where np is not defined when the function is executed or the reader macro is expanded, which occurs in some separate namespace I think. The first example works, but the second and third don't. I don't know if that is fixable. If anyone knows how, drop me a note in the comments!
</p>

<div class="org-src-container">

<pre class="src src-hy">(import [serialize [*]])
(import [infix [*]])
(<span style="color: #0000FF;">require</span> <span style="color: #006699;">infix</span>)

(import [numpy <span style="color: #D0372D;">:as</span> np])

(<span style="color: #006FE0;">print</span> (py-eval (stringify `(2 * np.exp(np.pi / 2)))))

(<span style="color: #0000FF;">try</span>
 (<span style="color: #006FE0;">print</span> (pymath `(2 * np.exp(np.pi / 2))))
 (<span style="color: #0000FF;">except</span> [e Exception]
   (<span style="color: #006FE0;">print</span> <span style="color: #008000;">"pymath: "</span> e)))

<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">this excepts so bad the try doesn't even catch it!</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">(try</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">(print #p(2 * np.exp(np.pi / 2)))</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">(except [e2 Exception]</span>
<span style="color: #8D8D84;">;;    </span><span style="color: #8D8D84; font-style: italic;">(print "reader macro: " e2)))</span>
</pre>
</div>

<pre class="example">
9.62095476193
pymath:  name 'np' is not defined
</pre>

<p>
This also does not work for a similar namespace issue.
</p>
<div class="org-src-container">

<pre class="src src-hy">(import [serialize [*]])
(import [infix [*]])
(<span style="color: #0000FF;">require</span> <span style="color: #006699;">infix</span>)

(import [numpy <span style="color: #D0372D;">:as</span> np])

(<span style="color: #006FE0;">setv</span> x 5)
(<span style="color: #0000FF;">try</span>
 (<span style="color: #006FE0;">print</span> (pymath `(3 * x)))
 (<span style="color: #0000FF;">except</span> [e Exception] (<span style="color: #006FE0;">print</span> e)))
</pre>
</div>

<pre class="example">
name 'x' is not defined
</pre>

<p>
Well, no problem, we will try some other approaches.
</p>
