org/2016/04/09/Getting-towards-an-infix-notation-for-hy.org
** Infix to prefix using code manipulation
This solution is inspired by https://sourceforge.net/p/readable/wiki/Solution/, but probably isn't a full implementation. We will first develop a function to convert infix notation to prefix notation. This function is recursive to deal with nested expressions. So far it doesn't seem possible to recurse with macros (at least, I cannot figure out how to do it). We tangle this function to infix.hy so we can use it later.

It will have some limitations though:

1. No operator precedence. This is too difficult for me to code. We will use parentheses for precedence.
2. Lisp syntax means 3+4 is not the same as 3 + 4. The first is interpreted as a name. So we will need spaces to separate everything.

#+BEGIN_SRC hy
(try
 (print (3+4))
 (except [e Exception]
   (print e)))

(print (+ 3 4))
#+END_SRC

#+RESULTS:
: name '3+4' is not defined
: 7

So, here is our infix function. Roughly, the function takes a CODE argument. If the CODE is iterable, it is a list of symbols, and we handle a few cases:
- If it is a string, we return it.
- if it has a length of one and is an expression we recurse on it, otherwise return the symbol.
- if it has a length of two, we assume a unary operator and recurse on each element.
- If there are three elements, we take the middle one as the operator, and switch it with the first element.
- Otherwise we switch the first and second elements, and recurse on the rest of the list.
- If it is not iterable we just return the element.

Two optional arguments provide some debug support to print what is happening.
#+BEGIN_SRC hy :tangle infix.hy
(import [serialize [*]])

(defn nfx [code &optional [indent 0] [debug False]]
  "Transform the CODE expression to prefix notation.
We assume that CODE is in infix notation."
  (when debug (print (* " " indent) "code: " code))
  (cond
   [(coll? code)
    (cond

     [(= 1 (len code))
      ;; element is an Expression
      (when debug (print "1: " code))
      (if (isinstance (car code) hy.models.expression.HyExpression)
        (nfx (car code) (+ indent 1) debug)
        ;; single element
        code)]

     ;; {- 1} ->  (- 1)
     [(= 2 (len code))
      (when debug (print "2: " code))
      `(~(nfx (get code 0) (+ indent 1) debug)
         ~(nfx (get code 1) (+ indent 1) debug))]

     ;; {1 + 2} -> (+ 1 2)
     [(= 3 (len code))
      (when debug (print (* " " indent) "3: " code))
      `(~(get code 1)
         ~(nfx (get code 0) (+ indent 1) debug)
         ~(nfx (get code 2) (+ indent 1) debug))]

     ;; longer expression, swap first two and take the rest.
     [true
      (when debug (print "expr: " code))
      `(~(nfx (get code 1) (+ indent 1) debug)
         ~(nfx (get code 0) (+ indent 1) debug)
         (~@(nfx (cut code 2) (+ indent 1) debug)))])]

   ;; non-iterable just gets returned
   [true
    (when debug (print (* " " indent) "true: " code))
    code]))
#+END_SRC

Now, for some tests. First, an example of debugging.

#+BEGIN_SRC hy
(import [infix [*]])
(print (nfx `(1 + (3 * 4)) :debug True))
#+END_SRC

#+RESULTS:
#+begin_example
 code:  (1L u'+' (3L u'*' 4L))
 3:  (1L u'+' (3L u'*' 4L))
  code:  1
  true:  1
  code:  (3L u'*' 4L)
  3:  (3L u'*' 4L)
   code:  3
   true:  3
   code:  4
   true:  4
(u'+' 1L (u'*' 3L 4L))
#+end_example

You can see we return a list of symbols, and the result is not evaluated. Now for some more thorough tests. I use a little helper function here to show the input and output.

#+BEGIN_SRC hy
(import [infix [*]])
(import [serialize [stringify]])

(defn show [code]
  (print (.format "{0} -> {1}\n"
                  (stringify code)
                  (stringify (nfx code)))))


(show 1)
(show `(1))
(show `(- 1))
(show `((1)))
(show `(- (2 + 1)))

(show `(2 ** 4))
(show `(3 < 5))

(show `(1 + 3 * 5 + 6 - 9))
(show `((1 + (1 + 2)) * 5 + 6 - 9))
(show `(1 + 1 * (5 - 4)))
(show `(1 + 1 * (np.exp (17 - 10))))

(show `(x + long-name)) ; note name mangling occurs.

(show `(1 + 1 + 1 + 1 + 1))

#+END_SRC

#+RESULTS:
#+begin_example
1 -> 1

(1) -> (1)

(- 1) -> (- 1)

((1)) -> (1)

(- (2 + 1)) -> (- (+ 2 1))

(2 ** 4) -> (** 2 4)

(3 < 5) -> (< 3 5)

(1 + 3 * 5 + 6 - 9) -> (+ 1 (* 3 (+ 5 (- 6 9))))

((1 + (1 + 2)) * 5 + 6 - 9) -> (* (+ 1 (+ 1 2)) (+ 5 (- 6 9)))

(1 + 1 * (5 - 4)) -> (+ 1 (* 1 (- 5 4)))

(1 + 1 * (np.exp (17 - 10))) -> (+ 1 (* 1 (np.exp (- 17 10))))

(x + long_name) -> (+ x long_name)

(1 + 1 + 1 + 1 + 1) -> (+ 1 (+ 1 (+ 1 (+ 1 1))))

#+end_example

Those all look reasonable I think. The last case could be simplified, but it would take some logic to make sure all the operators are the same, and that handles if any of the operands are expressions. We save that for later.

Now, we illustrate that the output code can be evaluated. Since we expand to code, we don't seem to have the namespace issues.

#+BEGIN_SRC hy
(import [infix [*]])

(print (eval (nfx `(1 + 1 * (5 - 4)))))

(import [numpy :as np])
(print (eval (nfx `(1 + 1 * (np.exp (17 - 10))))))
#+END_SRC

#+RESULTS:
: 2
: 1097.63315843

That syntax is not particularly nice, so next we build up a macro, and a new reader syntax. First, the macro.

#+BEGIN_SRC hy :tangle infix.hy
(defmacro $ [&rest code]
  (import infix)
  `(eval (infix.nfx ~code)))
#+END_SRC

Now we can use the simpler syntax here. It seems we still have quote the math to prevent it from being evaluated (which causes an error).

#+BEGIN_SRC hy
(import infix)
(require infix)

(print ($ `(1 + 1 * (5 - 4))))

(import [numpy :as np])
(print ($ `(1 + 1 * (np.exp (17 - 10)))))
#+END_SRC

#+RESULTS:
: 2
: 1097.63315843

For the penultimate act, we introduce a new syntax for this. In the [[https://sourceforge.net/p/readable/wiki/Solution/][sweet expression]] syntax we would use {} for this, but this isn't currently possible for hylang, and is also used for dictionaries. We define a reader macro for this.

#+BEGIN_SRC hy :tangle infix.hy
(defreader $ [code]
  (import infix)
  (infix.nfx code))
#+END_SRC

#+BEGIN_SRC hy
(import [infix [*]])
(require infix)

(import [numpy :as np])

(print #$(- 1))

(print #$(- (2 + 1)))

(print #$(2 ** 4))
(print #$(3 < 5))

(print #$(1 + 3 * 5 + 6 - 9))
(print #$((1 + (1 + 2)) * 5 + 6 - 9))
(print #$(1 + 1 * (5 - 4)))
(print #$(1 + 1 + 1 + 1 + 1))
(print #$(1 + 1 * (np.exp (17 - 10))))

(setv a 3 t 6)
(print #$(a + t))

(setv long-a 5 long-b 6)
(print #$(long-a + long-b))
#+END_SRC
#+RESULTS:
#+begin_example
-1
-3
16
True
7
8
2
5
1097.63315843
9
11
#+end_example

Wonderful! We get variables passed through, and the name-mangling doesn't seem to matter.

