_posts/2016-04-09-Getting-towards-an-infix-notation-for-hy.html

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Infix to prefix using code manipulation</h2>
<div class="outline-text-2" id="text-1">
<p>
This solution is inspired by <a href="https://sourceforge.net/p/readable/wiki/Solution/">https://sourceforge.net/p/readable/wiki/Solution/</a> , but probably isn't a full implementation. We will first develop a function to convert infix notation to prefix notation. This function is recursive to deal with nested expressions. So far it doesn't seem possible to recurse with macros (at least, I cannot figure out how to do it). We tangle this function to infix.hy so we can use it later.
</p>

<p>
It will have some limitations though:
</p>

<ol class="org-ol">
<li>No operator precedence. This is too difficult for me to code. We will use parentheses for precedence.
</li>
<li>Lisp syntax means 3+4 is not the same as 3 + 4. The first is interpreted as a name. So we will need spaces to separate everything.
</li>
</ol>

<div class="org-src-container">

<pre class="src src-hy">(<span style="color: #0000FF;">try</span>
 (<span style="color: #006FE0;">print</span> (3+4))
 (<span style="color: #0000FF;">except</span> [e Exception]
   (<span style="color: #006FE0;">print</span> e)))

(<span style="color: #006FE0;">print</span> (<span style="color: #006FE0;">+</span> 3 4))
</pre>
</div>

<pre class="example">
name '3+4' is not defined
7
</pre>

<p>
So, here is our infix function. Roughly, the function takes a CODE argument. If the CODE is iterable, it is a list of symbols, and we handle a few cases:
</p>
<ul class="org-ul">
<li>If it is a string, we return it.
</li>
<li>if it has a length of one and is an expression we recurse on it, otherwise return the symbol.
</li>
<li>if it has a length of two, we assume a unary operator and recurse on each element.
</li>
<li>If there are three elements, we take the middle one as the operator, and switch it with the first element.
</li>
<li>Otherwise we switch the first and second elements, and recurse on the rest of the list.
</li>
<li>If it is not iterable we just return the element.
</li>
</ul>

<p>
Two optional arguments provide some debug support to print what is happening.
</p>
<div class="org-src-container">

<pre class="src src-hy">(import [serialize [*]])

(<span style="color: #0000FF;">defn</span> <span style="color: #006699;">nfx</span> [code <span style="color: #6434A3;">&amp;optional</span> [indent 0] [debug <span style="color: #D0372D;">False</span>]]
  <span style="color: #008000;">"Transform the CODE expression to prefix notation.</span>
<span style="color: #008000;">We assume that CODE is in infix notation."</span>
  (<span style="color: #0000FF;">when</span> debug (<span style="color: #006FE0;">print</span> (<span style="color: #006FE0;">*</span> <span style="color: #008000;">" "</span> indent) <span style="color: #008000;">"code: "</span> code))
  (<span style="color: #0000FF;">cond</span>
   [(<span style="color: #006FE0;">coll?</span> code)
    (<span style="color: #0000FF;">cond</span>

     [(<span style="color: #006FE0;">=</span> 1 (len code))
      <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">element is an Expression</span>
      (<span style="color: #0000FF;">when</span> debug (<span style="color: #006FE0;">print</span> <span style="color: #008000;">"1: "</span> code))
      (<span style="color: #0000FF;">if</span> (isinstance (<span style="color: #006FE0;">car</span> code) hy.models.expression.HyExpression)
        (nfx (<span style="color: #006FE0;">car</span> code) (<span style="color: #006FE0;">+</span> indent 1) debug)
        <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">single element</span>
        code)]

     <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">{- 1} -&gt;  (- 1)</span>
     [(<span style="color: #006FE0;">=</span> 2 (len code))
      (<span style="color: #0000FF;">when</span> debug (<span style="color: #006FE0;">print</span> <span style="color: #008000;">"2: "</span> code))
      `(~(nfx (<span style="color: #006FE0;">get</span> code 0) (<span style="color: #006FE0;">+</span> indent 1) debug)
         ~(nfx (<span style="color: #006FE0;">get</span> code 1) (<span style="color: #006FE0;">+</span> indent 1) debug))]

     <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">{1 + 2} -&gt; (+ 1 2)</span>
     [(<span style="color: #006FE0;">=</span> 3 (len code))
      (<span style="color: #0000FF;">when</span> debug (<span style="color: #006FE0;">print</span> (<span style="color: #006FE0;">*</span> <span style="color: #008000;">" "</span> indent) <span style="color: #008000;">"3: "</span> code))
      `(~(<span style="color: #006FE0;">get</span> code 1)
         ~(nfx (<span style="color: #006FE0;">get</span> code 0) (<span style="color: #006FE0;">+</span> indent 1) debug)
         ~(nfx (<span style="color: #006FE0;">get</span> code 2) (<span style="color: #006FE0;">+</span> indent 1) debug))]

     <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">longer expression, swap first two and take the rest.</span>
     [<span style="color: #D0372D;">true</span>
      (<span style="color: #0000FF;">when</span> debug (<span style="color: #006FE0;">print</span> <span style="color: #008000;">"expr: "</span> code))
      `(~(nfx (<span style="color: #006FE0;">get</span> code 1) (<span style="color: #006FE0;">+</span> indent 1) debug)
         ~(nfx (<span style="color: #006FE0;">get</span> code 0) (<span style="color: #006FE0;">+</span> indent 1) debug)
         (~@(nfx (<span style="color: #006FE0;">cut</span> code 2) (<span style="color: #006FE0;">+</span> indent 1) debug)))])]

   <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">non-iterable just gets returned</span>
   [<span style="color: #D0372D;">true</span>
    (<span style="color: #0000FF;">when</span> debug (<span style="color: #006FE0;">print</span> (<span style="color: #006FE0;">*</span> <span style="color: #008000;">" "</span> indent) <span style="color: #008000;">"true: "</span> code))
    code]))
</pre>
</div>

<p>
Now, for some tests. First, an example of debugging.
</p>

<div class="org-src-container">

<pre class="src src-hy">(import [infix [*]])
(<span style="color: #006FE0;">print</span> (nfx `(1 + (3 * 4)) <span style="color: #D0372D;">:debug</span> <span style="color: #D0372D;">True</span>))
</pre>
</div>

<pre class="example">
 code:  (1L u'+' (3L u'*' 4L))
 3:  (1L u'+' (3L u'*' 4L))
  code:  1
  true:  1
  code:  (3L u'*' 4L)
  3:  (3L u'*' 4L)
   code:  3
   true:  3
   code:  4
   true:  4
(u'+' 1L (u'*' 3L 4L))
</pre>

<p>
You can see we return a list of symbols, and the result is not evaluated. Now for some more thorough tests. I use a little helper function here to show the input and output.
</p>

<div class="org-src-container">

<pre class="src src-hy">(import [infix [*]])
(import [serialize [stringify]])

(<span style="color: #0000FF;">defn</span> <span style="color: #006699;">show</span> [code]
  (<span style="color: #006FE0;">print</span> (.format <span style="color: #008000;">"{0} -&gt; {1}\n"</span>
                  (stringify code)
                  (stringify (nfx code)))))


(show 1)
(show `(1))
(show `(<span style="color: #006FE0;">-</span> 1))
(show `((1)))
(show `(<span style="color: #006FE0;">-</span> (2 + 1)))

(show `(2 ** 4))
(show `(3 &lt; 5))

(show `(1 + 3 * 5 + 6 - 9))
(show `((1 + (1 + 2)) * 5 + 6 - 9))
(show `(1 + 1 * (5 - 4)))
(show `(1 + 1 * (np.exp (17 - 10))))

(show `(x + long-name)) <span style="color: #8D8D84; font-style: italic;">; note name mangling occurs.</span>

(show `(1 + 1 + 1 + 1 + 1))
</pre>
</div>

<pre class="example">
1 -&gt; 1

(1) -&gt; (1)

(- 1) -&gt; (- 1)

((1)) -&gt; (1)

(- (2 + 1)) -&gt; (- (+ 2 1))

(2 ** 4) -&gt; (** 2 4)

(3 &lt; 5) -&gt; (&lt; 3 5)

(1 + 3 * 5 + 6 - 9) -&gt; (+ 1 (* 3 (+ 5 (- 6 9))))

((1 + (1 + 2)) * 5 + 6 - 9) -&gt; (* (+ 1 (+ 1 2)) (+ 5 (- 6 9)))

(1 + 1 * (5 - 4)) -&gt; (+ 1 (* 1 (- 5 4)))

(1 + 1 * (np.exp (17 - 10))) -&gt; (+ 1 (* 1 (np.exp (- 17 10))))

(x + long_name) -&gt; (+ x long_name)

(1 + 1 + 1 + 1 + 1) -&gt; (+ 1 (+ 1 (+ 1 (+ 1 1))))
</pre>

<p>
Those all look reasonable I think. The last case could be simplified, but it would take some logic to make sure all the operators are the same, and that handles if any of the operands are expressions. We save that for later.
</p>

<p>
Now, we illustrate that the output code can be evaluated. Since we expand to code, we don't seem to have the namespace issues.
</p>

<div class="org-src-container">

<pre class="src src-hy">(import [infix [*]])

(<span style="color: #006FE0;">print</span> (<span style="color: #006FE0;">eval</span> (nfx `(1 + 1 * (5 - 4)))))

(import [numpy <span style="color: #D0372D;">:as</span> np])
(<span style="color: #006FE0;">print</span> (<span style="color: #006FE0;">eval</span> (nfx `(1 + 1 * (np.exp (17 - 10))))))
</pre>
</div>

<pre class="example">
2
1097.63315843
</pre>

<p>
That syntax is not particularly nice, so next we build up a macro, and a new reader syntax. First, the macro.
</p>

<div class="org-src-container">

<pre class="src src-hy">(<span style="color: #0000FF;">defmacro</span> <span style="color: #006699;">$</span> [<span style="color: #6434A3;">&amp;rest</span> code]
  (<span style="color: #0000FF;">import</span> <span style="color: #006699;">infix</span>)
  `(<span style="color: #006FE0;">eval</span> (infix.nfx ~code)))
</pre>
</div>

<p>
Now we can use the simpler syntax here. It seems we still have quote the math to prevent it from being evaluated (which causes an error).
</p>

<div class="org-src-container">

<pre class="src src-hy">(<span style="color: #0000FF;">import</span> <span style="color: #006699;">infix</span>)
(<span style="color: #0000FF;">require</span> <span style="color: #006699;">infix</span>)

(<span style="color: #006FE0;">print</span> ($ `(1 + 1 * (5 - 4))))

(import [numpy <span style="color: #D0372D;">:as</span> np])
(<span style="color: #006FE0;">print</span> ($ `(1 + 1 * (np.exp (17 - 10)))))
</pre>
</div>

<pre class="example">
2
1097.63315843
</pre>

<p>
For the penultimate act, we introduce a new syntax for this. In the <a href="https://sourceforge.net/p/readable/wiki/Solution/">sweet expression</a> syntax we would use {} for this, but this isn't currently possible for hylang, and is also used for dictionaries. We define a reader macro for this.
</p>

<div class="org-src-container">

<pre class="src src-hy">(<span style="color: #0000FF;">defreader</span> <span style="color: #006699;">$</span> [code]
  (<span style="color: #0000FF;">import</span> <span style="color: #006699;">infix</span>)
  (infix.nfx code))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-hy">(import [infix [*]])
(<span style="color: #0000FF;">require</span> <span style="color: #006699;">infix</span>)

(import [numpy <span style="color: #D0372D;">:as</span> np])

(<span style="color: #006FE0;">print</span> #$(<span style="color: #006FE0;">-</span> 1))

(<span style="color: #006FE0;">print</span> #$(<span style="color: #006FE0;">-</span> (2 + 1)))

(<span style="color: #006FE0;">print</span> #$(2 ** 4))
(<span style="color: #006FE0;">print</span> #$(3 &lt; 5))

(<span style="color: #006FE0;">print</span> #$(1 + 3 * 5 + 6 - 9))
(<span style="color: #006FE0;">print</span> #$((1 + (1 + 2)) * 5 + 6 - 9))
(<span style="color: #006FE0;">print</span> #$(1 + 1 * (5 - 4)))
(<span style="color: #006FE0;">print</span> #$(1 + 1 + 1 + 1 + 1))
(<span style="color: #006FE0;">print</span> #$(1 + 1 * (np.exp (17 - 10))))

(<span style="color: #006FE0;">setv</span> a 3 t 6)
(<span style="color: #006FE0;">print</span> #$(a + t))

(<span style="color: #006FE0;">setv</span> long-a 5 long-b 6)
(<span style="color: #006FE0;">print</span> #$(long-a + long-b))
</pre>
</div>
<pre class="example">
-1
-3
16
True
7
8
2
5
1097.63315843
9
11
</pre>

<p>
Wonderful! We get variables passed through, and the name-mangling doesn't seem to matter.
</p>
</div>
</div>
